wmsmobile/src/Documents/униПоместитьВЯчейку/униПоместитьВЯчейку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>униПоместитьВЯчейку</name>
  <attributes>
    <name>КодУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>55</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТПУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомекнлатураНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияПроведена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОчистка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

wmsmobile/src/Documents/униПоместитьВЯчейку/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КодЯчейки = Объект.Ячейка;
	ТригерПриемаСканераШтрихКода = Истина;
КонецПроцедуры
&НаСервере
Процедура ПолучитьНнформациюОУпаковке(КодУпаковки)

	    Объект1 = РеквизитФормыВЗначение("Объект");
		Инфо ="";
        Объект1.ПолучитьИнформациюПоИДУпаковки(КодУпаковки, Инфо);
		ЗначениеВРеквизитФормы( Объект1,"Объект");
		Если Не ПустаяСтрока(Инфо) Тогда
			Сообщить(Инфо);
		КонецЕсли; 
		ЭтаФорма.ТолькоПросмотр = Объект.ОперацияПроведена;
КонецПроцедуры
 

&НаКлиенте
Процедура ОбработатьШК(ШтрихКодУчета)
	ТипКода = униОбщийМодуль.ОпрределитьТипСчитанногоШК(ШтрихКодУчета);
	Если Найти("Палета,СборнаяПалета,Короб,СборныйКороб,SSCC18,SSCC20",ТипКода) > 0  Тогда
	     ПолучитьНнформациюОУпаковке(ШтрихКодУчета);
		 ЕстьСчитанныйКод = Не ПустаяСтрока(Объект.КодУпаковки);
		 Элементы.ПоместитьВЯчейку.Доступность = ЯчейкаПрочитана И ЕстьСчитанныйКод;
	
	КонецЕсли; 
	Если ТипКода <> "Прочий" Тогда
	     Возврат;
	КонецЕсли; 
	МассивФрагов = СтрРазделить(ШтрихКодУчета,"-");
	МассивФраговКодаУчета = СтрРазделить(КодЯчейки,"-");
	МассивФраговШКода = СтрРазделить(ШтрихКодУчета,"-");
	ЭтоЦелыйКод =(МассивФраговШКода.Количество() =4); 
	МассивФраговПриемник = Новый Массив();
	МассивФраговПриемник.Добавить(?(ЭтоЦелыйКод,МассивФраговШКода[0],"XX"));
	МассивФраговПриемник.Добавить(?(ЭтоЦелыйКод,МассивФраговШКода[1],"XX"));
	МассивФраговПриемник.Добавить(?(ЭтоЦелыйКод,МассивФраговШКода[2],"XX"));
	МассивФраговПриемник.Добавить(?(ЭтоЦелыйКод,МассивФраговШКода[3],"XX"));
	
	Для а = 0 По МассивФраговКодаУчета.Количество()-1 Цикл
		Если ПустаяСтрока(МассивФраговКодаУчета[а]) Тогда
		     Продолжить;
		КонецЕсли; 
	    МассивФраговПриемник[а] = МассивФраговКодаУчета[а];
	КонецЦикла; 
	
	Если Найти(ШтрихКодУчета,"column#") > 0 Тогда
		 ТипШк =1;
		 ПрочитанныйКод = СтрЗаменить(ШтрихКодУчета,"column#","");
		 МассивФраговПрочитанногоКода = СтрРазделить(ПрочитанныйКод,"-");
		 Для а = 0 По МассивФраговПрочитанногоКода.Количество()-1 Цикл
		    МассивФраговПриемник[а] = МассивФраговПрочитанногоКода[а];
		 КонецЦикла; 

    ИначеЕсли Найти(ШтрихКодУчета,"level#") > 0 Тогда
		 ТипШк =2;
         ПрочитанныйКод =  СтрЗаменить(ШтрихКодУчета,"level#","");
		 МассивФраговПриемник[3] = ПрочитанныйКод;
	КонецЕсли; 
	КодЯчейки = ""+СокрЛП(МассивФраговПриемник[0])+"-"+СокрЛП(МассивФраговПриемник[1])+"-"+СокрЛП(МассивФраговПриемник[2])+"-"+СокрЛП(МассивФраговПриемник[3]);
	
	ЕстьСчитанныйКод = (Не ПустаяСтрока(Объект.КодУпаковки)) или Объект.ЭтоОчистка;

	Если Найти(КодЯчейки,"X")>0 Тогда
	    ЯчейкаПрочитана = Ложь;
	Иначе	
	    ЯчейкаПрочитана = Истина;
	КонецЕсли; 
		Элементы.ПоместитьВЯчейку.Доступность = ЯчейкаПрочитана И ЕстьСчитанныйКод;
		
	ОбновитьОтображениеДанных(Элементы.КодЯчейки);

КонецПроцедуры
  

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Объект.ОперацияПроведена Тогда
	     Возврат;
	КонецЕсли; 
	Если  ИмяСобытия="ОбработчикШтрихКода" и Источник="ОбработчикШтрихКода" тогда
		ШтрихКодУчета =Параметр;
		ОбработатьШК(ШтрихКодУчета);
	КонецЕсли;
	Если ИмяСобытия="ОбработчикШтрихКода" и Источник="ОшибкаЧтения" тогда
		Сообщить("ошибка чтения штрих-кода");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПоместитьВЯчейкуНаСервере()
		Объект1 = РеквизитФормыВЗначение("Объект");
		Инфо ="";
		СтруктураИнформации1 = Новый Структура("ЭтоОчистка,КодУпаковки,НоменклатураУИД,ИТПУИД,ДатаПроизводства,Количество,Ячейка",Объект.ЭтоОчистка,Объект.КодУпаковки,Объект.НоменклатураУИД,Объект.ИТПУИД,Объект.ДатаПроизводства,Объект.Количество,КодЯчейки);
        Объект1.ПоместитьВЯчейку(СтруктураИнформации1, Инфо);
		ЗначениеВРеквизитФормы( Объект1,"Объект");
		Если Не ПустаяСтрока(Инфо) Тогда
			Сообщить(Инфо);
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВЯчейку(Команда)
	Если Объект.ОперацияПроведена Тогда
	     Возврат;
	КонецЕсли; 
	Если ЯчейкаПрочитана = Ложь Тогда
	     Возврат;
	КонецЕсли; 
	Если Объект.ЭтоОчистка Тогда
	иначе	
		Если ПустаяСтрока(Объект.КодУпаковки) Тогда
		    Возврат;
		КонецЕсли; 
	     
	КонецЕсли; 
	

	ПоместитьВЯчейкуНаСервере();
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЭтоОчисткаПриИзменении(Элемент)
	Элементы.ПоместитьВЯчейку.Заголовок = ?(Объект.ЭтоОчистка,"Очистить ячейку", "Поместить в ячейку");
КонецПроцедуры

&НаСервере
Процедура ПроверитьСодержимоеЯчейкиНаСервере()
	Если Найти(КодЯчейки,"X")>0 Тогда
	     Возврат;
	КонецЕсли; 
	ПолучитьНнформациюОУпаковке(КодЯчейки);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСодержимоеЯчейки(Команда)
	ПроверитьСодержимоеЯчейкиНаСервере();
КонецПроцедуры
